Autodesk.Navisworks.Api.GridsRenderMode
Determines which Levels are rendered.

Autodesk.Navisworks.Api.GridsRenderMode.AboveAndBelow
Renders Levels directly above and directly below the current Viewpoint.

Autodesk.Navisworks.Api.GridsRenderMode.Above
Renders the Level directly above the current Viewpoint.

Autodesk.Navisworks.Api.GridsRenderMode.Below
Renders the Level directly below the current Viewpoint.

Autodesk.Navisworks.Api.GridsRenderMode.All
Renders all Levels.

Autodesk.Navisworks.Api.GridsRenderMode.Locked
Renders just the level you are locked to.